parsing-tech-log/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательОС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВСпискеВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноИзменятьПароль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Аватар</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
  </attributes>
  <attributes>
    <name>РежимЗапуска</name>
    <type>
      <types>EnumRef.РежимЗапускаКлиентскогоПриложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗащитаОтОпасныхДействий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль1С</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияСтандартная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

parsing-tech-log/src/Catalogs/Пользователи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
		Элементы.СтраницаКомментарий.Картинка = БиблиотекаКартинок.Карандаш_16х16;
	КонецЕсли;
	
	ОбновитьДоступностьРедактированияФормы();
	ОформлениеВидимостиАвторизацииWindows();
	ОформлениеВидимостиАвторизации1С();
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	ОбновитьТаблицуРолей();
	//КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Пароль1С = Объект.Ссылка.ПолучитьОбъект().Пароль1С.Получить();
		ПодтверждениеПароля1С = Пароль1С;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьТаблицуРолей();
	АватарИзХранилища = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка,"Аватар");
	Картинка = АватарИзХранилища.Получить();
	Если НЕ ЗначениеЗаполнено(Картинка) Тогда
		Аватар = БиблиотекаКартинок.АватарПоУмолчанию;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.АутентификацияСтандартная=Истина Тогда
		// отключим проверку на пароли
		//Если НЕ ЗначениеЗаполнено(Пароль1С) Тогда
		//	Отказ = Истина;
		//	Сообщить("Не заполнен пароль 1С");
		//	Возврат;
		//КонецЕсли;
		//Если СтрДлина(Пароль1С)<5 Тогда
		//	Отказ= Истина;
		//	Сообщить("Длина пароля должна быть не менее 5 символов");
		//	Возврат;
		//КонецЕсли;
	КонецЕсли;  
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Пароль1С = новый ХранилищеЗначения(Пароль1С);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ТаблицаПрав",Права.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДоступностьРедактированияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура АутентификацияОСПриИзменении(Элемент)
	ОформлениеВидимостиАвторизацииWindows();
КонецПроцедуры

&НаСервере
Процедура ОформлениеВидимостиАвторизацииWindows()
	Если Объект.АутентификацияОС=Истина Тогда
		Элементы.ПользовательОС.Доступность = Истина;
	Иначе
		Элементы.ПользовательОС.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуРолей()
	
	// заполним список ролей
	Права.Очистить();
	Для каждого Роль из Метаданные.Роли Цикл
		стр_н = Права.Добавить();
		стр_н.Имя = Роль.Имя;
		стр_н.Синоним = Роль.Синоним;
	КонецЦикла;
	
	// проставим установленные
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
	Если НЕ ПользовательИБ=Неопределено Тогда
		Для каждого стр из ПользовательИБ.Роли Цикл
			мОтбор = новый Структура("Имя",стр.Имя);
			н_строки = Права.НайтиСтроки(мОтбор);
			Если н_строки.Количество()=1 Тогда
				н_строки[0].Выбрана = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
		Элементы.СтраницаКомментарий.Картинка = БиблиотекаКартинок.Карандаш_16х16;
	Иначе
		Элементы.СтраницаКомментарий.Картинка = новый Картинка;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьРедактированияФормы()
	
	Возврат;
	
	ПолныйДоступ = Ложь;
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийПользователь.ИдентификаторПользователяИБ);	
	Если НЕ ПользовательИБ=Неопределено Тогда
		Для каждого стр из ПользовательИБ.Роли Цикл 
			Если стр.Имя="ПолныеПрава" Тогда
				ПолныйДоступ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПолныйДоступ=Ложь Тогда
		Элементы.СтраницаОсновное.Доступность = Ложь;
		Элементы.СтраницаРоли.Доступность = Ложь;
		Элементы.Недействителен.Доступность = Ложь;
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ НЕ ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ) Тогда
	//	Элементы.СтраницаРоли.Видимость = Ложь;
	//Иначе
	//	Элементы.СтраницаРоли.Видимость = Истина;
	//КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура СнятьФлажкиСРолей(Команда)
	Для каждого стр из Права Цикл
		стр.Выбрана = Ложь;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура УстановитьФлажкиНаРоли(Команда)
	Для каждого стр из Права Цикл
		стр.Выбрана = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Аутентификация1СПриИзменении(Элемент)
	ОформлениеВидимостиАвторизации1С();
КонецПроцедуры


&НаСервере
Процедура ОформлениеВидимостиАвторизации1С()
	Если Объект.АутентификацияСтандартная=Истина Тогда
		Элементы.ГруппаПароль1С.Доступность = Истина;
	Иначе
		Элементы.ГруппаПароль1С.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПароля1СПриИзменении(Элемент)
	ПоследнееПодтверждение = "";
	ПроверитьПодтверждениеПароля();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПароля1СИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПроверитьПодтверждениеПароля(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодтверждениеПароля(ПолеПароля = Неопределено)
	
	ПарольСовпадает = Ложь;
	
	Если ПолеПароля = Элементы.Пароль1С
	       Тогда
		
		ПарольСовпадает = (ПолеПароля.ТекстРедактирования = ПодтверждениеПароля1С);
		
	ИначеЕсли ПолеПароля = Элементы.ПодтверждениеПароля1С Тогда
		ПарольСовпадает = (ПодтверждениеПароля1С = ПолеПароля.ТекстРедактирования);
		
	Иначе
		ПарольСовпадает = (Пароль1С = ПодтверждениеПароля1С);
	КонецЕсли;
	
	Элементы.ГруппаОшибки.ТекущаяСтраница = ?(ПарольСовпадает,
		Элементы.СтраницаПустая, Элементы.СтраницаОшибка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьПодтверждениеПароля();
	ОбновитьОтображениеНедействителен();
КонецПроцедуры

&НаКлиенте
Процедура НедействителенПриИзменении(Элемент)
	ОбновитьОтображениеНедействителен();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеНедействителен()
	Элементы.СтраницыНастроек.ТолькоПросмотр = Объект.Недействителен;
КонецПроцедуры

&НаКлиенте
Процедура АватарНажатие(Элемент, СтандартнаяОбработка)	
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Диалог.Заголовок = "Выберите картинку аватара"; 
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "PNG-файл (*.png)|*.png"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь; 
	ЗагрузкаАватара = новый ОписаниеОповещения("ЗагрузкаАватара",ЭтотОбъект);
	Диалог.Показать(ЗагрузкаАватара);

	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаАватара(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		//ПутьКАватару = ВыбранныеФайлы[0]; 
		//ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКАватару);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеСокращенное) Тогда
		Объект.НаименованиеСокращенное = СтрЗаменить(Объект.Наименование," ","");
	КонецЕсли;
КонецПроцедуры
